import mongoose from "mongoose";

const OperationsSchema = new mongoose.Schema({
  locksmith: {
    type: Array,
    default: [
      "нарезка профеля",
      "выпрямление корпуса",
      "фрезеровка для гермоввода",
      "фрезеровка места под планки",
      "гравировка",
      "сверление отверстий для гермоввода",
      "обработка отверстий",
      "подготовка к покраске",
    ],
  },
  painter: {
    type: Array,
    default: [
      "подвешивание к покрасочной линии",
      "очистка перед покраской",
      "покраска",
      "прогрев в печи",
      "остывание",
      "снятие защитных заглушек",
    ],
  },
  millwright: {
    type: Array,
    default: [
      "подготовка места для монтажа платы",
      "монтаж платы",
      "нарезка проводов",
      "пайка элементов",
      "монтаж линз",
      "установка планок",
      "герметизация",
      "тесты работоспособности",
    ],
  },
});

export default mongoose.model("Operations", OperationsSchema);
